<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"8e5666c6e0672f7494669b5f9b017a42753a5a7fa5c664793222ca88a023b335","plan_job_ref":"Job Run Terraform plan in staging #158 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12776371502","plan_out_hash":"27ded0585dff3f3be8e27d77bc944b671ce686a4162c24187d34bef8ff1502fa","plan_hash":"726c7eb0833f358c0447325a24e7b6cb2fe9fa2388094d0659b2db5930840d92","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 3 to add, 3 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.external.set-egress-space-egress will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "set-egress-space-egress" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "set_space_egress.sh",
+           "-p",
+           "-s",
+           "capoc-stage-egress",
+           "-o",
+           "gsa-tts-devtools-prototyping",
        ]
+       result      = (known after apply)
+       working_dir = "."
    }

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "continuous_monitoring-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "YlhG1aDunJXY0c00guMlbO1c/J6RdfgqWW4qrVuDcxc=" -> "i2ozWW+SIfbesVOcVZBYrzT7SQdjz42aRQZUbVpbOFs="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-13T16:54:50Z" -> (known after apply)
#        (13 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.egress_proxy.data.external.proxyzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "proxyzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-proxy.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy"
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      path                        = "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy/proxy.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "e7c0c851594335804de4a0ef9987f14e28f037eff12f69ae058fad0b0b54ae86" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-03T15:01:55Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.egress_space.cloudfoundry_space_role.developers["a6885c8a-c011-4d34-b988-abc8033d138f"] must be replaced
-/+ resource "cloudfoundry_space_role" "developers" {
!~      created_at = "2024-12-26T21:32:40Z" -> (known after apply)
!~      id         = "************************************" -> (known after apply)
!~      updated_at = "2024-12-26T21:32:40Z" -> (known after apply)
-       username   = "a6885c8a-c011-4d34-b988-abc8033d138f" -> null # forces replacement
#        (3 unchanged attributes hidden)
    }

  # module.egress_space.cloudfoundry_space_role.developers["ryan.ahearn@gsa.gov"] must be replaced
-/+ resource "cloudfoundry_space_role" "developers" {
!~      created_at = "2024-12-26T21:32:40Z" -> (known after apply)
!~      id         = "************************************" -> (known after apply)
!~      updated_at = "2024-12-26T21:32:40Z" -> (known after apply)
-       username   = "ryan.ahearn@gsa.gov" -> null # forces replacement
#        (3 unchanged attributes hidden)
    }

  # module.egress_space.cloudfoundry_space_role.managers["a6885c8a-c011-4d34-b988-abc8033d138f"] must be replaced
-/+ resource "cloudfoundry_space_role" "managers" {
!~      created_at = "2024-12-26T21:32:40Z" -> (known after apply)
!~      id         = "************************************" -> (known after apply)
!~      updated_at = "2024-12-26T21:32:40Z" -> (known after apply)
-       username   = "a6885c8a-c011-4d34-b988-abc8033d138f" -> null # forces replacement
#        (3 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #158](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12776371502)